Ran Plan for 4 projects:

1. project: `gateway-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
1. project: `gateway-ecs-cluster-stage` dir: `terraform/environments/stage/ecs-cluster` workspace: `default`
1. project: `gateway-ecs-gateway-stage` dir: `terraform/environments/stage/ecs-gateway` workspace: `default`
1. project: `gateway-cloudfront-stage` dir: `terraform/environments/stage/cloudfront` workspace: `default`
---

### 1. project: `gateway-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.ecr_gateway.data.aws_caller_identity.current: Reading...
module.ecr_gateway.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecr_gateway.aws_ecr_lifecycle_policy.this[0] will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 15 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 15
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "stage",
                              + "latest",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after 3 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 3
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "gateway-stage"
    }

  # module.ecr_gateway.aws_ecr_repository.this will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "gateway-stage"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-gateway-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-gateway-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_gateway.aws_ecr_repository_policy.default[0] will be created
+ resource "aws_ecr_repository_policy" "default" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Sid       = "AllowPushPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "gateway-stage"
    }

  # module.ecr_gateway.aws_ssm_parameter.repository-url[0] will be created
+ resource "aws_ssm_parameter" "repository-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECR repository URL for gateway-stage"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/ecr/gateway-stage-repository-url"
      + tags           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + tags_all       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ gateway_repository_arn = (known after apply)
+ gateway_repository_url = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-ecr-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-ecr-stage
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 2. project: `gateway-ecs-cluster-stage` dir: `terraform/environments/stage/ecs-cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "gateway-cluster-stage"
      + tags     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-cluster-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway-ecs-cluster"
        }
      + tags_all = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-cluster-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway-ecs-cluster"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.main will be created
+ resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "gateway-cluster-stage"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE"
          + weight            = 30
        }
      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 70
        }
    }

  # aws_ssm_parameter.cluster_arn will be created
+ resource "aws_ssm_parameter" "cluster_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Gateway ECS cluster ARN (stage)"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/gateway/stage/ecs/cluster-arn"
      + tags           = {
          + "Environment" = "stage"
          + "Name"        = "gateway-ecs-cluster-arn-stage"
        }
      + tags_all       = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-ecs-cluster-arn-stage"
          + "Project"     = "gateway"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cluster_name will be created
+ resource "aws_ssm_parameter" "cluster_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Gateway ECS cluster name (stage)"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/gateway/stage/ecs/cluster-name"
      + tags           = {
          + "Environment" = "stage"
          + "Name"        = "gateway-ecs-cluster-name-stage"
        }
      + tags_all       = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-ecs-cluster-name-stage"
          + "Project"     = "gateway"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_arn  = (known after apply)
+ cluster_id   = (known after apply)
+ cluster_name = "gateway-cluster-stage"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-ecs-cluster-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-ecs-cluster-stage
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 3. project: `gateway-ecs-gateway-stage` dir: `terraform/environments/stage/ecs-gateway` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Gateway/33/default/terraform/environments/stage/ecs-gateway/gateway-ecs-gateway-stage-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Gateway/33/default/terraform/environments/stage/ecs-gateway": exit status 1
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.public_subnets: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
data.aws_ecr_repository.gateway: Reading...
module.log_streaming.data.aws_ssm_parameter.kinesis_stream_arn: Reading...
module.gateway_task_execution_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.redis_port: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.certificate_arn: Reading...
data.aws_ecs_cluster.main: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.gateway_task_execution_role.data.aws_region.current: Reading...
module.gateway_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.amp_workspace_arn: Reading...
module.gateway_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.sentry_dsn: Reading...
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/shared/network/route53-zone-id]
module.gateway_task_role.data.aws_region.current: Reading...
data.aws_ssm_parameter.public_subnets: Read complete after 0s [id=/shared/network/public-subnets]
data.aws_ssm_parameter.certificate_arn: Read complete after 0s [id=/shared/network/certificate-arn]
module.gateway_task_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.redis_port: Read complete after 0s [id=/shared/stage/elasticache/redis-port]
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
module.gateway_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.log_streaming.data.aws_ssm_parameter.kinesis_stream_arn: Read complete after 0s [id=/shared/logging/kinesis-stream-arn]
module.ecs_service.data.aws_region.current: Reading...
module.log_streaming.data.aws_ssm_parameter.cloudwatch_to_kinesis_role_arn: Reading...
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.redis_endpoint: Reading...
module.gateway_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_ssm_parameter.redis_endpoint: Read complete after 0s [id=/shared/stage/elasticache/redis-endpoint]
module.log_streaming.data.aws_ssm_parameter.cloudwatch_to_kinesis_role_arn: Read complete after 0s [id=/shared/logging/cloudwatch-to-kinesis-role-arn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_kms_alias.logs will be created
  + resource "aws_kms_alias" "logs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/gateway-logs-stage"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.logs will be created
  + resource "aws_kms_key" "logs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for Gateway CloudWatch logs encryption (stage)"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/gateway-stage/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ap-northeast-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Lifecycle"    = "staging"
          + "ManagedBy"    = "terraform"
          + "Name"         = "gateway-logs-kms-stage"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + tags_all                           = {
          + "Environment"  = "stage"
          + "Lifecycle"    = "staging"
          + "ManagedBy"    = "terraform"
          + "Name"         = "gateway-logs-kms-stage"
          + "Project"      = "gateway"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
    }

  # aws_lb.gateway will be created
  + resource "aws_lb" "gateway" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "gateway-alb-stage"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (sensitive value)
      + tags                                                         = {
          + "Lifecycle"    = "staging"
          + "ManagedBy"    = "terraform"
          + "Name"         = "gateway-alb-stage"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + tags_all                                                     = {
          + "Environment"  = "stage"
          + "Lifecycle"    = "staging"
          + "ManagedBy"    = "terraform"
          + "Name"         = "gateway-alb-stage"
          + "Project"      = "gateway"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Project"     = "gateway"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (sensitive value)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all                                                              = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Project"     = "gateway"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.gateway will be created
  + resource "aws_lb_target_group" "gateway" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "gateway-tg-stage"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"         = "gateway-tg-stage"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + tags_all                           = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "gateway-tg-stage"
          + "Project"      = "gateway"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + target_type                        = "ip"
      + vpc_id                             = (sensitive value)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # aws_route53_record.gateway will be created
  + resource "aws_route53_record" "gateway" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "stage-api.set-of.com"
      + type            = "A"
      + zone_id         = (sensitive value)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for ALB (stage)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP for redirect"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from anywhere"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "gateway-alb-sg-stage"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Lifecycle"    = "staging"
          + "ManagedBy"    = "terraform"
          + "Name"         = "gateway-alb-sg-stage"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + tags_all               = {
          + "Environment"  = "stage"
          + "Lifecycle"    = "staging"
          + "ManagedBy"    = "terraform"
          + "Name"         = "gateway-alb-sg-stage"
          + "Project"      = "gateway"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for gateway ECS tasks (stage)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "gateway-sg-stage"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for gateway ECS tasks (stage)"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-sg-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for gateway ECS tasks (stage)"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-sg-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
          + "Type"        = "custom"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-sg-stage-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-sg-stage-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
    }

  # module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                          = (known after apply)
      + description                  = "From ALB only"
      + from_port                    = 8080
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-sg-stage-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + tags_all                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-sg-stage-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + to_port                      = 8080
    }

  # module.gateway_logs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/gateway-stage/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.gateway_task_execution_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for gateway-execution-role-stage"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gateway-execution-role-stage"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-execution-role-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-execution-role-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + unique_id             = (known after apply)
    }

  # module.gateway_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "gateway-execution-role-stage-ssm-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.gateway_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "gateway-execution-role-stage"
    }

  # module.gateway_task_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for gateway-task-role-stage"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gateway-task-role-stage"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-task-role-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "stage"
          + "Lifecycle"   = "temporary"
          + "ManagedBy"   = "terraform"
          + "Name"        = "gateway-task-role-stage"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "gateway"
          + "Service"     = "gateway"
        }
      + unique_id             = (known after apply)
    }

  # module.gateway_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "gateway-task-role-stage-adot-amp-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:RemoteWrite",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      + Sid      = "AMPRemoteWrite"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingRules",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "XRayTracing"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/gateway/otel:*",
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/gateway/otel-collector:*",
                        ]
                      + Sid      = "CloudWatchLogsAccess"
                    },
                  + {
                      + Action    = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "Gateway"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "CloudWatchMetricsAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-connectly/otel-config/*"
                      + Sid      = "S3OtelConfigAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.log_streaming.aws_cloudwatch_log_subscription_filter.to_kinesis will be created
  + resource "aws_cloudwatch_log_subscription_filter" "to_kinesis" {
      + destination_arn = (sensitive value)
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/gateway-stage/application"
      + name            = "gateway-stage-to-kinesis"
      + role_arn        = (sensitive value)
        # (1 unchanged attribute hidden)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_arn        = (known after apply)
  + alb_dns_name   = (known after apply)
  + fqdn           = "stage-api.set-of.com"
  + kms_key_arn    = (known after apply)
  + log_group_name = "/aws/ecs/gateway-stage/application"
  + url            = "https://stage-api.set-of.com"
╷
│ Error: reading ECR Repository (gateway-stage): couldn't find resource
│ 
│   with data.aws_ecr_repository.gateway,
│   on main.tf line 27, in data "aws_ecr_repository" "gateway":
│   27: data "aws_ecr_repository" "gateway" {
│ 
╵
╷
│ Error: reading ECS Cluster (gateway-cluster-stage): empty result
│ 
│   with data.aws_ecs_cluster.main,
│   on main.tf line 34, in data "aws_ecs_cluster" "main":
│   34: data "aws_ecs_cluster" "main" {
│ 
╵
╷
│ Error: reading SSM Parameter (/gateway/stage/sentry/dsn): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sentry_dsn,
│   on main.tf line 127, in data "aws_ssm_parameter" "sentry_dsn":
│  127: data "aws_ssm_parameter" "sentry_dsn" {
│ 
╵

```
</details>

---
### 4. project: `gateway-cloudfront-stage` dir: `terraform/environments/stage/cloudfront` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Gateway/33/default/terraform/environments/stage/cloudfront/gateway-cloudfront-stage-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Gateway/33/default/terraform/environments/stage/cloudfront": exit status 1
data.aws_lb.gateway: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
data.aws_cloudfront_origin_request_policy.all_viewer: Reading...
data.aws_cloudfront_cache_policy.caching_disabled: Reading...
data.aws_lb.frontend_stage: Reading...
data.aws_cloudfront_cache_policy.caching_optimized: Reading...
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/shared/network/route53-zone-id]
data.aws_lb.frontend_stage: Read complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/turbo-setof-web-stage/e86cf1b620a13a5f]
data.aws_acm_certificate.cloudfront_cert: Reading...
data.aws_cloudfront_cache_policy.caching_disabled: Read complete after 1s [id=4135ea2d-6df8-44a3-9df3-4b5a84be39ad]
data.aws_cloudfront_origin_request_policy.all_viewer: Read complete after 1s [id=216adef6-5c7f-47e4-b989-5492eafa07d3]
data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 1s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_acm_certificate.cloudfront_cert: Read complete after 2s [id=arn:aws:acm:us-east-1:646886795421:certificate/505bcd90-dab2-4906-b35c-0fd355e23cd4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudfront_cache_policy.api_no_cache will be created
  + resource "aws_cloudfront_cache_policy" "api_no_cache" {
      + arn         = (known after apply)
      + comment     = "No caching for API requests - forward all to origin (stage)"
      + default_ttl = 0
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 0
      + min_ttl     = 0
      + name        = "gateway-api-no-cache-stage"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }
          + headers_config {
              + header_behavior = "none"
            }
          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # aws_cloudfront_cache_policy.nextjs_image will be created
  + resource "aws_cloudfront_cache_policy" "nextjs_image" {
      + arn         = (known after apply)
      + comment     = "Cache policy for Next.js Image Optimization (stage)"
      + default_ttl = 86400
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 31536000
      + min_ttl     = 0
      + name        = "gateway-nextjs-image-stage"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "whitelist"

              + headers {
                  + items = [
                      + "Accept",
                    ]
                }
            }

          + query_strings_config {
              + query_string_behavior = "all"
            }
        }
    }

  # aws_cloudfront_cache_policy.public_static will be created
  + resource "aws_cloudfront_cache_policy" "public_static" {
      + arn         = (known after apply)
      + comment     = "Cache policy for public static files (stage)"
      + default_ttl = 86400
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 604800
      + min_ttl     = 3600
      + name        = "gateway-public-static-stage"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "none"
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # aws_cloudfront_origin_request_policy.api_all_viewer will be created
  + resource "aws_cloudfront_origin_request_policy" "api_all_viewer" {
      + arn     = (known after apply)
      + comment = "Forward all viewer headers + X-Forwarded-For for API requests (stage)"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "gateway-api-all-viewer-stage"

      + cookies_config {
          + cookie_behavior = "all"
        }

      + headers_config {
          + header_behavior = "allViewerAndWhitelistCloudFront"

          + headers {
              + items = [
                  + "CloudFront-Forwarded-Proto",
                  + "CloudFront-Is-Mobile-Viewer",
                  + "CloudFront-Viewer-Address",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # aws_cloudfront_response_headers_policy.api_cors will be created
  + resource "aws_cloudfront_response_headers_policy" "api_cors" {
      + arn     = (known after apply)
      + comment = "CORS headers for API responses (stage)"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "gateway-api-cors-stage"

      + cors_config {
          + access_control_allow_credentials = true
          + access_control_max_age_sec       = 86400
          + origin_override                  = false

          + access_control_allow_headers {
              + items = [
                  + "Accept",
                  + "Authorization",
                  + "Content-Type",
                  + "Origin",
                  + "X-Requested-With",
                ]
            }

          + access_control_allow_methods {
              + items = [
                  + "DELETE",
                  + "GET",
                  + "HEAD",
                  + "OPTIONS",
                  + "PATCH",
                  + "POST",
                  + "PUT",
                ]
            }

          + access_control_allow_origins {
              + items = [
                  + "https://set-of.com",
                  + "https://stage.set-of.com",
                  + "https://www.set-of.com",
                ]
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_cache_policy_id          = (known after apply)
  + api_cors_policy_id           = (known after apply)
  + api_origin_request_policy_id = (known after apply)
╷
│ Error: reading ELBv2 Load Balancers: couldn't find resource
│ 
│   with data.aws_lb.gateway,
│   on provider.tf line 105, in data "aws_lb" "gateway":
│  105: data "aws_lb" "gateway" {
│ 
╵

```
</details>

---
### Plan Summary

4 projects, 2 with changes, 0 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```